`cdk deploy`すると以下が行われるっぽい。普通に動いた

1. `terraform init`
2. `terraform plan`
3. (approveしたら) `terraform apply`

PR: https://github.com/yamoyamoto/cdk_for_tf_playground/pull/2

## 該当コード

```typescript
    new AwsProvider(this, "AWS", {
      region: "ap-northeast-1",
    });

    const ec2Instance = new Instance(this, "compute", {
      ami: "ami-0599b6e53ca798bb2",
      instanceType: "t2.micro",
    });

    new TerraformOutput(this, "public_ip", {
      value: ec2Instance.publicIp,
    });
```

## ログ

```console
$ cdktf deploy
(node:87949) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cdk_for_tf_playground  Initializing the backend...
cdk_for_tf_playground  Initializing provider plugins...
                       - Reusing previous version of hashicorp/aws from the dependency lock file
cdk_for_tf_playground  - Using previously-installed hashicorp/aws v5.91.0
cdk_for_tf_playground  Terraform has been successfully initialized!
                       
                       You may now begin working with Terraform. Try running "terraform plan" to see
                       any changes that are required for your infrastructure. All Terraform commands
                       should now work.

                       If you ever set or change modules or backend configuration for Terraform,
                       rerun this command to reinitialize your working directory. If you forget, other
                       commands will detect it and remind you to do so if necessary.
cdk_for_tf_playground  Terraform used the selected providers to generate the following execution plan.
                       Resource actions are indicated with the following symbols:
                         + create

                       Terraform will perform the following actions:
cdk_for_tf_playground    # aws_instance.compute (compute) will be created
                         + resource "aws_instance" "compute" {
                             + ami                                  = "ami-0599b6e53ca798bb2"
                             + arn                                  = (known after apply)
                             + associate_public_ip_address          = (known after apply)
                             + availability_zone                    = (known after apply)
                             + cpu_core_count                       = (known after apply)
                             + cpu_threads_per_core                 = (known after apply)
                             + disable_api_stop                     = (known after apply)
                             + disable_api_termination              = (known after apply)
                             + ebs_optimized                        = (known after apply)
                             + enable_primary_ipv6                  = (known after apply)
                             + get_password_data                    = false
cdk_for_tf_playground  + host_id                              = (known after apply)
                             + host_resource_group_arn              = (known after apply)
                             + iam_instance_profile                 = (known after apply)
                             + id                                   = (known after apply)
                             + instance_initiated_shutdown_behavior = (known after apply)
                             + instance_lifecycle                   = (known after apply)
                             + instance_state                       = (known after apply)
                             + instance_type                        = "t2.micro"
                             + ipv6_address_count                   = (known after apply)
                             + ipv6_addresses                       = (known after apply)
                             + key_name                             = (known after apply)
                             + monitoring                           = (known after apply)
                             + outpost_arn                          = (known after apply)
cdk_for_tf_playground  + password_data                        = (known after apply)
                             + placement_group                      = (known after apply)
                             + placement_partition_number           = (known after apply)
                             + primary_network_interface_id         = (known after apply)
                             + private_dns                          = (known after apply)
                             + private_ip                           = (known after apply)
                             + public_dns                           = (known after apply)
                             + public_ip                            = (known after apply)
                             + secondary_private_ips                = (known after apply)
                             + security_groups                      = (known after apply)
                             + source_dest_check                    = true
                             + spot_instance_request_id             = (known after apply)
cdk_for_tf_playground  + subnet_id                            = (known after apply)
                             + tags_all                             = (known after apply)
                             + tenancy                              = (known after apply)
                             + user_data                            = (known after apply)
                             + user_data_base64                     = (known after apply)
                             + user_data_replace_on_change          = false
                             + vpc_security_group_ids               = (known after apply)

                             + capacity_reservation_specification (known after apply)

                             + cpu_options (known after apply)

                             + ebs_block_device (known after apply)

                             + enclave_options (known after apply)

                             + ephemeral_block_device (known after apply)

                             + instance_market_options (known after apply)

                             + maintenance_options (known after apply)

                             + metadata_options (known after apply)
cdk_for_tf_playground  + network_interface (known after apply)

                             + private_dns_name_options (known after apply)

                             + root_block_device (known after apply)
                           }

                       Plan: 1 to add, 0 to change, 0 to destroy.
                       
                       Changes to Outputs:
                         + public_ip = (known after apply)
                       
                       Do you want to perform these actions?
                         Terraform will perform the actions described above.
                         Only 'yes' will be accepted to approve.
cdk_for_tf_playground  Enter a value: yes
cdk_for_tf_playground  aws_instance.compute: Creating...
cdk_for_tf_playground  aws_instance.compute: Still creating... [10s elapsed]
cdk_for_tf_playground  aws_instance.compute: Creation complete after 12s [id=i-0f563b80b57a7c046]
cdk_for_tf_playground  
                       Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
                       
                       Outputs:

                       public_ip = "13.115.76.168"

  cdk_for_tf_playground
  public_ip = 13.115.76.168
```